#### Terraform Workspace - `boundary`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aetherisnova/boundary/runs/run-77WDoBismYLXUEip

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_project.project will be created
  + resource "digitalocean_project" "project" {
      + created_at  = (known after apply)
      + description = "Organization wide infrastructure."
      + environment = "Production"
      + id          = (known after apply)
      + is_default  = false
      + name        = "boundary"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Operational / Developer tooling"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # module.domain.digitalocean_domain.domain will be created
  + resource "digitalocean_domain" "domain" {
      + id   = (known after apply)
      + name = "aetherisnova.org"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kieranroneill, Action: `pull_request`, Working Directory: ``, Workflow: `Boundary`*